Revit 2024 API
BuiltInFailures.StairRampFailures.NoRisersInPureMonolithicStairs Property
 Monolithic Stairs with zero tread thickness can't have risers
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoRisersInPureMonolithicStairs { get; }
Visual Basic
Public Shared ReadOnly Property NoRisersInPureMonolithicStairs As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoRisersInPureMonolithicStairs {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace